In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv(r"C:\Users\HOME\Downloads\StudentsPerformance.csv")

In [3]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33

In [4]:
print(df.shape)

(1000, 8)

In [5]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
gender                         1000 non-null object
race/ethnicity                 1000 non-null object
parental level of education    1000 non-null object
lunch                          1000 non-null object
test preparation course        1000 non-null object
math score                     1000 non-null int64
reading score                  1000 non-null int64
writing score                  1000 non-null int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB
None

In [16]:
df.describe()

        math_score  reading_score  writing_score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [6]:
#1. Find out how many males and females participated in the test.
count = df.gender.value_counts()
count

female    518
male      482
Name: gender, dtype: int64

In [11]:
#2 What do you think about the students' parental level of education?
df.columns = df.columns.str.replace(' ', '_')
df.head()
education_parental_level = df.parental_level_of_education.value_counts()
education_parental_level

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental_level_of_education, dtype: int64

In [13]:
#3. Who scores the most on average for math, reading and writing based on
#● Gender
#● Test preparation course

most_average = df.groupby(['gender','test_preparation_course'],as_index=False).agg({'math_score':'mean','reading_score':'mean','writing_score':'mean'})
most_average

   gender test_preparation_course  math_score  reading_score  writing_score
0  female               completed   67.108696      77.375000      78.793478
1  female                    none   61.320359      69.955090      68.982036
2    male               completed   72.988506      70.793103      70.339080
3    male                    none   66.467532      62.581169      59.551948

In [14]:
#4. What do you think about the scoring variation for math, reading and writing based on
#● Gender
#● Test preparation course
df.groupby('gender').var()

        math_score  reading_score  writing_score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [15]:
#5. The management needs your help to give bonus points to the top 25% of students based on their math score, so how will you help the management to achieve this.
top25percent = df['math_score'].quantile(.75)
print(f"Students math score above {top25percent} gets bonus points")

Students math score above 77.0 gets bonus points